# Assignment 3

The following code loads a popular dataset so-called titanic.csv into a dataframe named *titanic*. As you may guess, this is a real data set that stores some important information about the passengers of Titanic. 

The columns are organized as "PassengerId", "Survived", "Pclass", "Name", "Sex", "Age", "SibSp", "Parch", "Ticket", "Fare", "Cabin", "Embarked". The column named "Survived" shows whether a passenger survided (with 1) or not (with 0) from this tragic accident. Use this dataset to answer the questions below. You can create as many cells as you desire for all solutions.<br/>

**Note:**
*  Make sure the csv file is in the the same folder as your notebook

In [6]:
import pandas as pd
titanic = pd.read_csv('titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Question 1:
Write a function named "data_preprocessing" that accepts the dataset in dataframe as only argument and does the following tasks and returns the updated dataframe:<br/>
1. Drop "PassengerId" and "Ticket" columns from the dataframe.(1 pts)
2. Check if there are any rows that have missing entries for any of the columns and remove such rows from the given dataset.(1 pts)
3.  Convert the data type of "Fare" and "Age" to int.(1 pts)
4. Rename "SibSp" to "Siblings/Spouses Aboard", and "Parch" to "Parents/Children Aboard".(1 pts)

In [8]:
#Work on your solution here and after. 
#make sure to follow the given structure below

def data_preprocessing(titanic):
    titanic = titanic.drop(["PassengerId", "Ticket"], axis=1)
    titanic = titanic.dropna()
    titanic["Fare"] = titanic["Fare"].astype(int)
    titanic["Age"] = titanic["Age"].astype(int)
    titanic = titanic.rename(columns={"SibSp": "Siblings/Spouses Aboard", "Parch": "Parents/Children Aboard"})
    
    return titanic
#Write your function here

new_titanic = data_preprocessing(titanic)
#Call your function here

#Report results
new_titanic.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Cabin,Embarked
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,71,C85,C
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,53,C123,S
6,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,51,E46,S
10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,16,G6,S
11,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,26,C103,S

## Question 2:
We are interested in adding new columns which are so-called features.<br/>
Create a new function called "feature_extraction" which does the following updates to the existing dataframe.<br/>

1. Convert "Embarked" column into numeric. Replace "S" with 0; replace "C" with 1 and replace "Q" with 2. For the missing values under "Embarked", just fill with the most common one (ex: if there are 100 0, 200 1, and 300 2 in column, then 2 is the most common. fill missing values with 2). (2 pts)
2. The column named "Cabin" includes strings with letters and numbers, for example "C85" and the letter refers to the cabin group. This column should indicate integer value of 1 for cabin name starting with letter "A". The rest of the numbers should appear according to this dictionary: {"A": 1, "B": 2, "C": 3, "D": 4, "E": 5, "F": 6, "G": 7, "U": 8}. Any missing and/or other character entries should be replaced with 0. If there are multiple names, only the first character matters (ex: "F C100 B90 30", then it is F and "F":6) (2 pts)
3. (2 pts) Any missing values from "Fare" column should be replaced with 0, and update it according to the following conditions:<br/>
  if 0 <= 'Fare' < 10, then 'Fare' = 0<br/>
  if 10 <= 'Fare' < 20, then 'Fare' = 1<br/>
  if 20 <= 'Fare' < 30, then 'Fare' = 2<br/>
  if 30 <= 'Fare' < 100, then 'Fare' = 3<br/>
  if 100 <= 'Fare' < 200, then 'Fare' = 4<br/>
  if 200 <= 'Fare' then 'Fare' = 5<br/>

**Note:** Use the orignal datset without considering the modifications from **Question 1**

In [9]:
#Work on your solution here and after. 
#Write your function here

#Call your function here
new_titanic = feature_extraction(new_titanic)

#Report results
new_titanic.head()

NameError: name 'feature_extraction' is not defined